contiki-os/contiki/cpu/arm/aducrf101/Common/radioeng.c
#define symbol_mode_symbol_length_8_bit                  (0 << 0)
#define symbol_mode_data_whitening_disabled              (0 << 3)
#define symbol_mode_data_whitening_enabled               (1 << 3)
#define symbol_mode_eight_ten_enc_disabled               (0 << 4 )
#define symbol_mode_prog_crc_en_disabled                 (0 << 5)
#define symbol_mode_manchester_enc_enabled               (1 << 6)

#define radio_cfg_8_pa_single_diff_sel_single_ended      (0x0  << 7)
#define radio_cfg_8_pa_single_diff_sel_differential      (0x1  << 7)
#define radio_cfg_8_pa_power_numbits                     (4)
#define radio_cfg_8_pa_power_offset                      (3)
#define radio_cfg_8_pa_power_setting_63                  (0xF << radio_cfg_8_pa_power_offset)
#define radio_cfg_8_pa_ramp_numbits                      (3)
#define radio_cfg_8_pa_ramp_offset                       (0)
#define radio_cfg_8_pa_ramp_16                           (0x5 << radio_cfg_8_pa_ramp_offset) 

#define radio_cfg_9_demod_scheme_offset                  (0)
#define radio_cfg_9_demod_scheme_FSK                     (0x0  << radio_cfg_9_demod_scheme_offset)
#define radio_cfg_9_mod_scheme_numbits                   (3)
#define radio_cfg_9_mod_scheme_offset                    (3)
#define radio_cfg_9_mod_scheme_2_level_FSK               (0x0  << radio_cfg_9_mod_scheme_offset)
#define radio_cfg_9_mod_scheme_2_level_GFSK              (0x1  << radio_cfg_9_mod_scheme_offset)
#define radio_cfg_9_ifbw_numbits                         (2)
#define radio_cfg_9_ifbw_offset                          (6)
#define radio_cfg_9_ifbw_100kHz                          (0x0  << radio_cfg_9_ifbw_offset)
#define radio_cfg_9_ifbw_150kHz                          (0x1  << radio_cfg_9_ifbw_offset)
#define radio_cfg_9_ifbw_200kHz                          (0x2  << radio_cfg_9_ifbw_offset)
#define radio_cfg_9_ifbw_300kHz                          (0x3  << radio_cfg_9_ifbw_offset)

/*************************************************************************/
/*                Local Variables                                        */
/*************************************************************************/
static TyRadioConfiguration RadioConfiguration;
static RIE_BOOL             bRadioConfigurationChanged    = RIE_FALSE; 
static RIE_BOOL             bTestModeEnabled              = RIE_FALSE; 
static RIE_U32              DataRate                      = 38400; 
static RIE_BOOL             bPacketTx                     = RIE_FALSE; 
static RIE_BOOL             bPacketRx                     = RIE_FALSE; 

const RIE_U8 DR_38_4kbps_Dev20kHz_Configuration[] = 
{
   0x14,0x00,0x00,0x00,0x00,0x00,0x00,0x33,0x00,0x76,0x62,0x21,

// 0    1    2    3    4    5    6    7    8    9    A    B
   0x80,0x01,0xC8,0x20,0x0E,0x00,0x00,0x00,0xFD,0x00,0x0B,0x37,
   0x16,0x07,

   0x40,0x0C,0x00,0x0C,0x00,0x00,
   0x10,0x00,0xC3,0x36,0x10,0x10,0x24,0xF0,0x2A,0x00,0x2F,0x19,0x5E,0x46,0x5F,0x78,
   0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00 
};


const RIE_U8 DR_300_0kbps_Dev75_0kHz_Configuration[] = 
{
   0x14,0x00,0x00,0x00,0x00,0x00,0x00,0x33,0x00,0x76,0x62,0x21,

// 0    1    2    3    4    5    6    7    8    9    A    B
   0xB8,0x2B,0xEE,0x0B,0x70,0x00,0x03,0x00,0xFD,0xC0,0x0B,0x37,
   0x16,0x07,

   0x40,0x0C,0x00,0x0C,0x00,0x00,
   0x10,0x00,0xC3,0x36,0x10,0x10,0x24,0xF0,0x2A,0x00,0x2F,0x19,0x5E,0x46,0x5F,0x78,
   0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
};



const RIE_U8 DR_1_0kbps_Dev10_0kHz_Configuration[] = 
{
   0x14,0x00,0x00,0x00,0x00,0x00,0x00,0x33,0x00,0x76,0x62,0x21,
//   0    1    2    3    4    5    6    7    8    9    A    B
   0x0A,0x00,0x64,0x41,0x01,0x00,0x02,0x00,0xFD,0x00,0x0B,0x37,
   0x16,0x07,

   0x40,0x0C,0x00,0x0C,0x00,0x00,
   0x10,0x00,0xC3,0x36,0x10,0x10,0x24,0xF0,0x2A,0x00,0x2F,0x19,0x5E,0x46,0x5F,0x78,
   0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
};

/*************************************************************************/
/*                Local Functions                                        */
/*************************************************************************/
static RIE_Responses RadioSPIXferByte           (RIE_U8           ucByte,
                                                 RIE_U8 *         pData);
static RIE_Responses RadioSendCommandBytes      (RIE_U8 *         pCmdBytes,
                                                 RIE_U8           NumBytes);
static RIE_Responses RadioSendCommandNoWait     (Radio_CmdCodes   CmdCode);
static RIE_Responses RadioSendCommandWait       (Radio_CmdCodes   CmdCode);
static RIE_Responses RadioMMapRead              (RIE_U32          ulAdr, 
                                                 RIE_U32          ulLen, 
                                                 RIE_U8 *         pData);
static RIE_Responses RadioMMapWrite             (RIE_U32          ulAdr,
                                                 RIE_U32          ulLen,
                                                 RIE_U8 *         pData);
static RIE_Responses RadioReadState             (RadioState *     pState);
static RIE_Responses RadioWaitOnState           (RadioState       FinalState);
static RIE_Responses RadioWaitForPowerUp        (void);
static RIE_Responses RadioSyncComms             (void);
static RIE_Responses SetRadioConfiguration      (RIE_BaseConfigs BaseConfig);
static RIE_Responses RadioCommitRadioConfig     (void);
static RIE_Responses RadioConfigure             (void);
static RIE_Responses RadioToOnMode              (void);
static RIE_Responses RadioToOffMode             (void);
static RIE_Responses RadioWaitOnCmdLdr          (void);
/*************************************************************************/
/*                Functions Implementations - Start                      */
/*************************************************************************/

/**
   @fn RIE_Responses RadioGetAPIVersion(RIE_U32 *pVersion)
   @brief Return the Radio Interface Engine API Version
   @param pVersion :{}
      pVersion Storage for Radio Interface Engine API version.
   @code    
      RIE_U32 Version;
      Response = RadioGetAPIVersion(&Version);
   @endcode
   @return RIE_Responses  Error code.
**/

RIE_Responses RadioGetAPIVersion(RIE_U32 *pVersion)
{
   RIE_Responses  Response = RIE_Success;

   if (pVersion)
      *pVersion = RIE_ENGINE_MINOR_VERSION | (RIE_ENGINE_MAJOR_VERSION << 8);
   return Response;
}


/**
   @fn RIE_U32 RadioSwitchConfig(RIE_BaseConfigs BaseConfig)
   @brief Change the Radio to using specified configuration.
   @param BaseConfig :{DR_1_0kbps_Dev10_0kHz, DR_38_4kbps_Dev20kHz, DR_300_0kbps_Dev75_0kHz}
      - DR_1_0kbps_Dev10_0kHz  Base configuration of 1 kbps datarate, 10.0 kHz frequency deviation.
      - DR_38_4kbps_Dev20kHz  Base configuration of 38.4 kbps datarate, 20 kHz frequency deviation.
      - DR_300_0kbps_Dev75_0kHz  Base configuration of 300 kbps datarate, 75 kHz frequency deviation.
   @pre    
      RadioInit() must be called before this function is called. 
   @return RIE_Responses  Error code.
**/

RIE_Responses RadioSwitchConfig(RIE_BaseConfigs BaseConfig)
{
   RIE_Responses  Response = RIE_Success;
   if(Response == RIE_Success)
      Response = RadioToOffMode();
   if(Response == RIE_Success)
      Response = SetRadioConfiguration(BaseConfig);
   if(Response == RIE_Success)
      Response = RadioCommitRadioConfig();
   if(Response == RIE_Success)
      Response = RadioToOnMode();
   return Response;
}


/**
   @fn RIE_U32 RadioInit(RIE_BaseConfigs BaseConfig)
   @brief Initialise the Radio, using specified configuration.
   @param BaseConfig :{DR_1_0kbps_Dev10_0kHz , DR_38_4kbps_Dev20kHz ,DR_300_0kbps_Dev75_0kHz }
      - DR_1_0kbps_Dev10_0kHz  Base configuration of 1 kbps datarate, 10.0 kHz frequency deviation.
      - DR_38_4kbps_Dev20kHz  Base configuration of 38.4 kbps datarate, 20 kHz frequency deviation.
      - DR_300_0kbps_Dev75_0kHz  Base configuration of 300 kbps datarate, 75 kHz frequency deviation.
   @note    
      This must be called before any other function is called.
   @return RIE_Responses  Error code.
**/

RIE_Responses RadioInit(RIE_BaseConfigs BaseConfig)
{
   RIE_Responses  Response = RIE_Success;

   // Disable the radio interrupt until we have initialised the radio
   NVIC_DisableIRQ(UHFTRX_IRQn);

   // Initialise GPIO Port 2 for Radio Use
   pADI_GP2->GPCON   =  GP2CON_CON0_SPI0MISO  | GP2CON_CON1_SPI0SCLK | 
                        GP2CON_CON2_SPI0MOSI  | GP2CON_CON3_GPIO     | 
                        GP2CON_CON4_IRQ8      | GP2CON_CON5_GPIO     |
                        GP2CON_CON6_GPIO      | GP2CON_CON7_GPIOIRQ7;

   pADI_GP2->GPOEN   =  GP2OEN_OEN0_IN        |  GP2OEN_OEN1_IN      |  
                        GP2OEN_OEN2_IN        |  GP2OEN_OEN3_OUT     |  
                        GP2OEN_OEN4_IN        |  GP2OEN_OEN5_IN      |
                        GP2OEN_OEN6_IN        |  GP2OEN_OEN7_IN;

   // Disable the PULL-Up on P2.4 which is connected to the radio
   GP2PUL_PUL4_BBA = 0x0;

   // Configure the SPI Interface to the Radio and flush it
   pADI_SPI0->SPIDIV =  ((SYSTEM_UCLK/RADIO_SPI_CLK_FREQ)/2)-0x1;
   pADI_SPI0->SPICON =  SPICON_MASEN   |    // Master mode
                        SPICON_TIM     |    // Interrupt on transmit
                        SPICON_TFLUSH  |    // Flush FIFO
                        SPICON_RFLUSH  |    // Flush FIFO
                        SPICON_ENABLE;
   pADI_SPI0->SPICON =  SPICON_MASEN   |    // Master mode
                        SPICON_TIM     |    // Interrupt on transmit
                        SPICON_ENABLE;

   // Initialise the chip select line to starting position
   RADIO_CSN_DEASSERT;


   // Power it down and up again to return to a known state
   // which will be PHY_OFF.
   // This will clear any pre-existing radio interrupt before
   // we enable the Cortex interrupt handling of it
   if(Response == RIE_Success)
      Response = RadioPowerOff();
   // Configure a "high level" radio interrupt ... 
   pADI_INTERRUPT->EI2CFG = EI2CFG_IRQ8MDE_HIGHLEVEL | EI2CFG_IRQ8EN;  
   // ... and set it up in the NVIC so that our interrupt handler is called
   // when the radio wants our attention. Clear any pre-existing condition
   // before enabling the interrupt.
   pADI_INTERRUPT->EICLR  = EICLR_IRQ8;
   NVIC_ClearPendingIRQ(UHFTRX_IRQn);
   NVIC_SetPriority    (UHFTRX_IRQn,0x0);
   NVIC_EnableIRQ      (UHFTRX_IRQn);

