contiki-os/contiki/cpu/arm/aducrf101/Common/radioeng.c
   if(Response == RIE_Success)
      Response = RadioWaitForPowerUp();
   if(Response == RIE_Success)
      Response = RadioSyncComms();
   if(Response == RIE_Success)
      Response = RadioToOffMode();
   if(Response == RIE_Success)
      Response = SetRadioConfiguration(BaseConfig);
   if(Response == RIE_Success)
      Response = RadioCommitRadioConfig();
   if(Response == RIE_Success)
      Response = RadioToOnMode();
   return Response;
}

/**
   @fn RIE_U32 RadioDeInit(void)
   @brief Deinitialise the Radio, and power it down.
   @note    
      This can be called independently of all other functions to power down
      the radio
   @return RIE_Responses  Error code.
**/

RIE_Responses RadioDeInit(void)
{
   RIE_Responses  Response = RIE_Success;

   // Disable the radio interrupt
   NVIC_DisableIRQ(UHFTRX_IRQn);

   // Initialise GPIO Port 2 for Radio Use
   pADI_GP2->GPCON   =  GP2CON_CON0_SPI0MISO  | GP2CON_CON1_SPI0SCLK | 
                        GP2CON_CON2_SPI0MOSI  | GP2CON_CON3_GPIO     | 
                        GP2CON_CON4_IRQ8      | GP2CON_CON5_GPIO     |
                        GP2CON_CON6_GPIO      | GP2CON_CON7_GPIOIRQ7;

   pADI_GP2->GPOEN   =  GP2OEN_OEN0_IN        |  GP2OEN_OEN1_IN      |  
                        GP2OEN_OEN2_IN        |  GP2OEN_OEN3_OUT     |  
                        GP2OEN_OEN4_IN        |  GP2OEN_OEN5_IN      |
                        GP2OEN_OEN6_IN        |  GP2OEN_OEN7_IN;

   // Enable the pull-up as we are powering down the radion
   GP2PUL_PUL4_BBA = 0x1;

   // Configure the SPI Interface to the Radio and flush it
   pADI_SPI0->SPIDIV =  ((SYSTEM_UCLK/RADIO_SPI_CLK_FREQ)/2)-0x1;
   pADI_SPI0->SPICON =  SPICON_MASEN   |    // Master mode
                        SPICON_TIM     |    // Interrupt on transmit
                        SPICON_TFLUSH  |    // Flush FIFO
                        SPICON_RFLUSH  |    // Flush FIFO
                        SPICON_ENABLE;
   pADI_SPI0->SPICON =  SPICON_MASEN   |    // Master mode
                        SPICON_TIM     |    // Interrupt on transmit
                        SPICON_ENABLE;

   // Initialise the chip select line to starting position
   RADIO_CSN_DEASSERT;

   // Power it down
   Response = RadioSendCommandNoWait(CMD_HW_RESET);

   return Response;
}

/**
   @fn RIE_Responses RadioPowerOff(void)
   @brief Shutdown the radio and place it in its lowest power sleep mode.	
   @pre    
      RadioInit() must be called before this function is called.
   @return RIE_Response  Error code.
**/

RIE_Responses RadioPowerOff(void)
{
   volatile RIE_U32  ulDelay;
   RIE_Responses     Response = RIE_Success;

   Response = RadioSendCommandNoWait(CMD_HW_RESET);

   // Delay for approximately 1 ms
   ulDelay  = 0x1000;
   while (ulDelay--);

   return Response;
}

/** 
   @fn      RIE_Responses RadioTerminateRadioOp(void)
   @brief   Terminate a currently running radio RX or TX operation.
   @pre     RadioInit() must be called before this function is called.
   @code    
      if (RIE_Response == RIE_Success)
         RIE_Response = RadioRxPacketFixedLen(12);
      // Delay for a while waiting for a packet   
      if (RIE_Response == RIE_Success)
         {
         // Abort the waiting
         RIE_Response = RadioTerminateRadioOp();
         }
   @endcode
   @return  RIE_Responses  Error code
**/
RIE_Responses RadioTerminateRadioOp        (void)
{
   RIE_Responses Response = RIE_Success;

   Response = RadioToOnMode();

   return Response;
}

/** 
   @fn RIE_Responses RadioSetFrequency(RIE_U32 Frequency)
   @brief Set frequency for radio communications
   @param Frequency :{431000000-928000000} 
      - This must be within the available bands of the radio: 
         - 431000000Hz to 464000000Hz and 
         - 862000000Hz to 928000000Hz.
   @pre     RadioInit() must be called before this function is called.
   @code    
      if (RIE_Response == RIE_Success)
         RIE_Response = RadioSetFrequency(915000000);
   @endcode
   @return  RIE_Responses  Error code
**/
RIE_Responses RadioSetFrequency(RIE_U32 Frequency)
{
   RIE_Responses  Response = RIE_Success;
   RIE_U32        EncodedFrequency;

   bRadioConfigurationChanged = RIE_TRUE;

   EncodedFrequency                     = (RIE_U32)(Frequency * FREQ_CNVRT_VAL);
   RadioConfiguration.channel_freq_0_r  = (EncodedFrequency >> 0) & 0xFF;
   RadioConfiguration.channel_freq_1_r  = (EncodedFrequency >> 8) & 0xFF;
   RadioConfiguration.channel_freq_2_r  = (EncodedFrequency >> 16)& 0xFF;
   if (Frequency >= 862000000)
      {
      RadioConfiguration.image_reject_cal_amplitude_r   = 0x07; 
      RadioConfiguration.image_reject_cal_phase_r       = 0x16;
      }
   else
      {
      RadioConfiguration.image_reject_cal_amplitude_r   = 0x03; 
      RadioConfiguration.image_reject_cal_phase_r       = 0x08;
      }
   return Response;
}

/** 
   @fn RIE_Responses RadioSetModulationType(RIE_ModulationTypes ModulationType)
   @brief Set the Radio Transmitter Modulation Type. Can be FSK_Modulation or GFSK_Modulation.
   @param ModulationType :{DR_1_0kbps_Dev10_0kHz , DR_38_4kbps_Dev20kHz ,DR_300_0kbps_Dev75_0kHz }
      - DR_1_0kbps_Dev10_0kHz  Base configuration of 1 kbps datarate, 10.0 kHz frequency deviation.
      - DR_38_4kbps_Dev20kHz  Base configuration of 38.4 kbps datarate, 20 kHz frequency deviation.
      - DR_300_0kbps_Dev75_0kHz  Base configuration of 300 kbps datarate, 75 kHz frequency deviation.
   @pre     RadioInit() must be called before this function is called.
   @code    
      Response = RadioSetModulationType(GFSK_Modulation);
   @endcode
   @note   FSK_Modulation is used by default.
   @return  RIE_Responses  Error code
**/
RIE_Responses RadioSetModulationType(RIE_ModulationTypes ModulationType)
{
   RIE_Responses  Response    = RIE_Success;
   RIE_U8         ucNewCode;
   RIE_U8         ucNewRegVal = RadioConfiguration.radio_cfg_9_r;

   switch (ModulationType)
      {
      case FSK_Modulation:
         ucNewCode = radio_cfg_9_mod_scheme_2_level_FSK;
         break;
      case GFSK_Modulation:
         ucNewCode = radio_cfg_9_mod_scheme_2_level_GFSK;
         break;
      default:
         Response   = RIE_UnsupportedRadioConfig;
         break;
      }
   if(Response == RIE_Success)
      {
      ucNewRegVal  =  MSKSET_VAL(RadioConfiguration.radio_cfg_9_r,
                                 radio_cfg_9_mod_scheme_numbits,
                                 radio_cfg_9_mod_scheme_offset,
                                 ucNewCode);
      if (ucNewRegVal != RadioConfiguration.radio_cfg_9_r )
         {
         bRadioConfigurationChanged        = RIE_TRUE;
         RadioConfiguration.radio_cfg_9_r  = ucNewRegVal; 
         }

