contiki-os/contiki/cpu/arm/aducrf101/Common/radioeng.c
      }
   return Response;
}

/** 
    @fn    RIE_Responses RadioPayldManchesterEncode(RIE_BOOL bEnable)  
    @brief Enable or Disable Manchester Encoding of payload data.

           Manchester encoding can be used to ensure a dc-free (zero mean) 
           transmission. 

           A Binary 0 is mapped to 10, and a Binary 1 is mapped to 01. 

           Manchester encoding and decoding are applied to the payload data 
           and the CRC. 
     
    @param  bEnable :{RIE_FALSE,RIE_TRUE}
         - RIE_TRUE if Manchester Encoding is to be enabled. 
         - RIE_FALSE if disabled.

    @pre     RadioInit() must be called before this function is called.
     @code    
             Response = RadioPayldManchesterEncode(RIE_TRUE);

     @endcode
     @note   Manchester Encoding is disabled by default.
     @return RIE_Responses  Error code
**/
RIE_Responses RadioPayldManchesterEncode(RIE_BOOL bEnable)
{
   RIE_Responses  Response     = RIE_Success;
   RIE_U8         ucNewRegVal  = RadioConfiguration.symbol_mode_r;

   switch (bEnable)
      {
      case RIE_FALSE:
         ucNewRegVal &= ~symbol_mode_manchester_enc_enabled;
         break;
      case RIE_TRUE:
         ucNewRegVal |= symbol_mode_manchester_enc_enabled;
         break;
      default:
         Response   = RIE_UnsupportedRadioConfig;
         break;
      }
   if(Response == RIE_Success)
      {
      if (ucNewRegVal != RadioConfiguration.symbol_mode_r )
         {
         bRadioConfigurationChanged        = RIE_TRUE;
         RadioConfiguration.symbol_mode_r  = ucNewRegVal; 
         }
      }
   return Response;
}
/** 
    @fn      RIE_Responses RadioPayldDataWhitening(RIE_BOOL bEnable)
    @brief   Enable or Disable Data Whitening of payload data.  

             Data whitening can be employed to avoid long runs of 1s or 0s
             in the transmitted data stream. 

             This ensures sufficient bit transitions in the packet, which 
             aids in receiver clock and data recovery because the encoding 
             breaks up long runs of 1s or 0s in the transmit packet. 

             The data, excluding the preamble and sync word, is automatically
             whitened before transmission by XORing the data with an 8-bit 
             pseudorandom sequence. 

             At the receiver, the data is XORed with the same pseudorandom 
             sequence, thereby reversing the whitening. 

             The linear feedback shift register polynomial used is x7 + x1 + 1.

    @param  bEnable :{RIE_FALSE, RIE_TRUE}
         - RIE_TRUE if Manchester Encoding is to be enabled. 
         - RIE_FALSE if disabled.

    @pre     RadioInit() must be called before this function is called.
    @code    
             Response = RadioPayldDataWhitening(RIE_TRUE);

     @endcode
     @note   Data Whitening is disabled by default.
     @return  RIE_Responses  Error code
**/
RIE_Responses RadioPayldDataWhitening(RIE_BOOL bEnable)
{
   RIE_Responses  Response     = RIE_Success;
   RIE_U8         ucNewRegVal  = RadioConfiguration.symbol_mode_r;

   switch (bEnable)
      {
      case RIE_FALSE:
         ucNewRegVal &= ~symbol_mode_data_whitening_enabled;
         break;
      case RIE_TRUE:
         ucNewRegVal |= symbol_mode_data_whitening_enabled;
         break;
      default:
         Response   = RIE_UnsupportedRadioConfig;
         break;
      }
   if(Response == RIE_Success)
      {
      if (ucNewRegVal != RadioConfiguration.symbol_mode_r )
         {
         bRadioConfigurationChanged        = RIE_TRUE;
         RadioConfiguration.symbol_mode_r  = ucNewRegVal; 
         }
      }
   return Response;
}

/** 
   @fn     RIE_Responses RadioTxPacketFixedLen(RIE_U8 Len, RIE_U8 *pData)    
   @brief  Transmit a fixed length packet. 
   @param  Len :{1-240}   Length of packet to be transmitted.
   @param  pData :{} Data bytes to be transmitted.
   @pre     RadioInit() must be called before this function is called.
   @code    
      if (RIE_Response == RIE_Success)
         RIE_Response = RadioTxSetPA(DifferentialPA,PowerLevel15);
      if (RIE_Response == RIE_Success)
         RIE_Response = RadioTxPacketFixedLen(12, "HELLO WORLD");
      while (!RadioTxPacketComplete());
   @endcode
   @return  RIE_Responses  Error code
**/
RIE_Responses RadioTxPacketFixedLen(RIE_U8 Len, RIE_U8 *pData)
{
   RIE_Responses  Response     = RIE_Success;

   bPacketTx = RIE_FALSE;
   if (Len > PACKETRAM_LEN)
      Response = RIE_InvalidParamter;
   if (Response == RIE_Success)
      Response = RadioToOnMode();
   if (Response == RIE_Success)
      Response = RadioMMapWrite(PACKETRAM_START, Len, pData);
   if (Response == RIE_Success)
      {
      RadioConfiguration.packet_length_max_r     = Len;
      RadioConfiguration.packet_length_control_r |= packet_length_control_packet_len_fixed;
      }
   if(Response == RIE_Success)
      Response = RadioCommitRadioConfig();
   if (Response == RIE_Success)
      Response = RadioToOnMode();
   if (Response == RIE_Success)
      Response = RadioSendCommandWait(CMD_PHY_TX);

   return Response;
}

/** 
   @fn     RIE_Responses RadioTxPacketVariableLen(RIE_U8 Len, RIE_U8 *pData)    
   @brief  Transmit a Variable length packet. 
   @param  Len :{1-240}   Length of packet to be transmitted.
   @param  pData :{} Data bytes to be transmitted.
   @pre     RadioInit() must be called before this function is called.
   @code    
      if (RIE_Response == RIE_Success)
         RIE_Response = RadioTxSetPA(DifferentialPA,PowerLevel15);
      if (RIE_Response == RIE_Success)
         RIE_Response = RadioTxPacketVariableLen(12, "HELLO WORLD");
      while (!RadioTxPacketComplete());
   @endcode
   @return  RIE_Responses  Error code
**/
RIE_Responses RadioTxPacketVariableLen(RIE_U8 Len, RIE_U8 *pData)
{
   RIE_Responses  Response     = RIE_Success;

   bPacketTx = RIE_FALSE;

   Len += 0x1;
   if (Len > PACKETRAM_LEN)
      Response = RIE_InvalidParamter;
   if (Response == RIE_Success)
      Response = RadioToOnMode();
   if (Response == RIE_Success)
      Response = RadioMMapWrite(PACKETRAM_START, 0x1, &Len);
   if (Response == RIE_Success)
      Response = RadioMMapWrite(PACKETRAM_START+0x1, Len-1, pData);
   if (Response == RIE_Success)
      {
      RadioConfiguration.packet_length_max_r     = PACKETRAM_LEN;
      RadioConfiguration.packet_length_control_r &= ~packet_length_control_packet_len_fixed;
      }
   if(Response == RIE_Success)
      Response = RadioCommitRadioConfig();
   if (Response == RIE_Success)
      Response = RadioToOnMode();
   if (Response == RIE_Success)
      Response = RadioSendCommandWait(CMD_PHY_TX);

