contiki-os/contiki/cpu/arm/aducrf101/Common/radioeng.c
   return Response;
}


/** 
   @fn    RIE_BOOL RadioTxPacketComplete(void)  
   @brief Checks if a packet has finished transmitting
   @pre     RadioInit() must be called before this function is called.
   @pre     RadioRxPacketFixedLen() or equivalent should be called first.
   @code    
      if (RIE_Response == RIE_Success)
         RIE_Response = RadioTxSetPA(DifferentialPA,PowerLevel15);
      if (RIE_Response == RIE_Success)
         RIE_Response = RadioTxPacketFixedLen(12, "HELLO WORLD");
      while (!RadioTxPacketComplete());
   @endcode
   @return  RIE_BOOL  RIE_TRUE if packet has finished transmitting, else RIE_FALSE
**/
RIE_BOOL      RadioTxPacketComplete     (void)
{
   return bPacketTx;
}

/** 
   @fn     RIE_Responses RadioTxSetPA(RIE_PATypes PAType,RIE_PAPowerLevel Power)    
   @brief  Set PA Type and the Transmit Power Level for Radio Transmission. 
   @param  PAType :{DifferentialPA, SingleEndedPA} Select Single Ended or Differential PA Type
   @param  Power :{PowerLevel0 ,PowerLevel1 ,PowerLevel2 ,PowerLevel3,
           PowerLevel4 ,PowerLevel5 ,PowerLevel6 ,PowerLevel7,
           PowerLevel8 ,PowerLevel9 ,PowerLevel10,PowerLevel11,
           PowerLevel12,PowerLevel13,PowerLevel14,PowerLevel15} 
   @pre    RadioInit() must be called before this function is called.
   @code    
             Response = RadioTxSetPA(SingleEndedPA,PowerLevel8);
   @endcode
   @note   Differential PA is enabled by default.
   @note   Max TX Power is used by default.
   @return  RIE_Responses  Error code
**/
RIE_Responses RadioTxSetPA(RIE_PATypes PAType,RIE_PAPowerLevel Power)
{
   RIE_Responses  Response     = RIE_Success;
   RIE_U8         ucNewRegVal  = 0x0;
   unsigned long  pa_level_mcr,pa_ramp, codes_per_bit,min_codes_per_bit;

   switch (PAType)
      {
      case DifferentialPA:
         ucNewRegVal |= radio_cfg_8_pa_single_diff_sel_differential;
         break;
      case SingleEndedPA:
         ucNewRegVal |= radio_cfg_8_pa_single_diff_sel_single_ended;
         break;
      default:
         Response   = RIE_UnsupportedRadioConfig;
         break;
      }
   if(Response == RIE_Success)
      {
      switch (Power)
         {
         case PowerLevel0 :
         case PowerLevel1 :
         case PowerLevel2 :
         case PowerLevel3 :
         case PowerLevel4 :
         case PowerLevel5 :
         case PowerLevel6 :
         case PowerLevel7 :
         case PowerLevel8 :
         case PowerLevel9 :
         case PowerLevel10:
         case PowerLevel11:
         case PowerLevel12:
         case PowerLevel13:
         case PowerLevel14:
         case PowerLevel15:
            ucNewRegVal |= ((RIE_U8)Power << radio_cfg_8_pa_power_offset);
            // Calculate the minimum allowable codes per bit
            pa_level_mcr =  (((RIE_U8)Power)* 4) + 0x3;
            min_codes_per_bit = (pa_level_mcr * 2500)/(DataRate/100);
            pa_ramp        = 0x1;
            codes_per_bit  = 256;
            while (codes_per_bit > min_codes_per_bit)
               {
               pa_ramp++;
               codes_per_bit = 512 >> pa_ramp;
               if (pa_ramp >= 7)
                  break; // This is the maximum
               }
            ucNewRegVal |= ((RIE_U8)pa_ramp << radio_cfg_8_pa_ramp_offset);
            break;
         default:
            Response   = RIE_UnsupportedRadioConfig;
            break;
         }
      }

   if(Response == RIE_Success)
      {
      if (ucNewRegVal != RadioConfiguration.radio_cfg_8_r )
         {
         bRadioConfigurationChanged        = RIE_TRUE;
         RadioConfiguration.radio_cfg_8_r  = ucNewRegVal; 
         }
      }
   return Response;
}
/** 
   @fn      RIE_Responses RadioTxCarrier(void)
   @brief   Transmit a carrier tone
            using the current radio configuration.
   @pre     RadioInit() must be called before this function is called.
   @code    
      Response = RadioTxCarrier();
   @endcode
   @note   Terminate this mode by calling RadioTerminateRadioOp();
   @return  RIE_Responses  Error code
**/
RIE_Responses RadioTxCarrier     (void)
{
   RIE_Responses Response = RIE_Success;
   RIE_U8        ParamTX  = PARAM_TX_CARRIER_FOREVER;

   if(Response == RIE_Success)
      Response = RadioCommitRadioConfig();
   bTestModeEnabled = RIE_TRUE;
   if (Response == RIE_Success)
      Response = RadioToOnMode();
   // Mode needs to be set, before entry to PHY_TX
   if (Response == RIE_Success)
      Response = RadioMMapWrite(PR_var_tx_mode_ADR,sizeof(ParamTX),&ParamTX);
   if (Response == RIE_Success)
      Response = RadioSendCommandWait(CMD_PHY_TX);
   return Response;
}
/** 
   @fn      RIE_Responses RadioTxPreamble(void)
   @brief   Transmit a pre-amble (alternating ones and zeros)
            using the current radio configuration.
   @pre     RadioInit() must be called before this function is called.
   @code    
      Response = RadioTxPreamble();
   @endcode
   @note   Terminate this mode by calling RadioTerminateRadioOp();
   @return  RIE_Responses  Error code
**/
RIE_Responses RadioTxPreamble    (void)
{
   RIE_Responses Response = RIE_Success;
   RIE_U8        ParamTX  = PARAM_TX_PREAMBLE_FOREVER;

   if(Response == RIE_Success)
      Response = RadioCommitRadioConfig();
   if (Response == RIE_Success)
      Response = RadioToOnMode();
   bTestModeEnabled = RIE_TRUE;
   // Mode needs to be set, before entry to PHY_TX
   if (Response == RIE_Success)
      Response = RadioMMapWrite(PR_var_tx_mode_ADR,sizeof(ParamTX),&ParamTX);
   if (Response == RIE_Success)
      Response = RadioSendCommandWait(CMD_PHY_TX);
   return Response;
}

/** 
   @fn     RIE_Responses RadioRxPacketFixedLen(RIE_U8 Len)
   @brief  Enter receive mode and wait for a packet to be received.

      Radio will stay in Receive Mode until 
         1) A packet is received. 
         2) User manually exits Receive Mode with a call to RadioTerminateRadioOp()
     
   @param  Len :{1-240} Fixed Length of packet to be received.
   @pre     RadioInit() must be called before this function is called.
   @return  RIE_Responses  Error code
**/
RIE_Responses RadioRxPacketFixedLen(RIE_U8 Len)
{
   RIE_Responses  Response = RIE_Success;

   bPacketRx = RIE_FALSE;
   if (Len > PACKETRAM_LEN)
      Response = RIE_InvalidParamter;

   if (Response == RIE_Success)
      {
      RadioConfiguration.packet_length_max_r     = Len;
      RadioConfiguration.packet_length_control_r |= packet_length_control_packet_len_fixed;
      }
   if(Response == RIE_Success)
      Response = RadioCommitRadioConfig();
   if (Response == RIE_Success)
      Response = RadioToOnMode();
   if (Response == RIE_Success)
      Response = RadioSendCommandWait(CMD_PHY_RX);
   return Response;
}

/** 
    @fn     RIE_Responses RadioRxPacketVariableLen(void)
    @brief  Enter receive mode and wait for a packet to be received.

