contiki-os/contiki/cpu/arm/aducrf101/Common/radioeng.c
            Radio will stay in Receive Mode until 
            1) A packet is received. 
            2) User manually exits Receive Mode with a call to RadioTerminateRadioOp()
     
    @pre     RadioInit() must be called before this function is called.
    @return  RIE_Responses  Error code
**/
RIE_Responses RadioRxPacketVariableLen(void)
{
   RIE_Responses  Response = RIE_Success;

   bPacketRx = RIE_FALSE;

   if (Response == RIE_Success)
      {
      RadioConfiguration.packet_length_max_r     = PACKETRAM_LEN;
      RadioConfiguration.packet_length_control_r &= ~packet_length_control_packet_len_fixed;
      }
   if(Response == RIE_Success)
      Response = RadioCommitRadioConfig();
   if (Response == RIE_Success)
      Response = RadioToOnMode();
   if (Response == RIE_Success)
      Response = RadioSendCommandWait(CMD_PHY_RX);
   return Response;
}

/** 
    @fn    RIE_BOOL RadioRxPacketAvailable(void)  
    @brief Checks if a packet has been received.  
    @pre   RadioInit() must be called before this function is called.
    @pre   RadioRxPacketFixedLen() or equivalent should be called first.
     @code    
           if (RIE_Response == RIE_Success)
              RIE_Response = RadioRxPacketFixedLen(12);
           if (RIE_Response == RIE_Success)
              {
              while (!RadioRxPacketAvailable());
              }
           if (RIE_Response == RIE_Success)
              {
              unsigned char  Buffer[0x20];
              RIE_U8         PktLen;
              RIE_S8         RSSI;
              RIE_Response = RadioRxPacketRead(sizeof(Buffer),&PktLen,Buffer,&RSSI);
              }
     @endcode
    @return  RIE_BOOL  RIE_TRUE if packet received, else RIE_FALSE
**/
RIE_BOOL RadioRxPacketAvailable(void)
{
   return bPacketRx;

}

/** 
   @fn     RIE_Responses RadioRxPacketRead(RIE_U8 BufferLen,RIE_U8 *pPktLen,RIE_U8 *pData,RIE_S8 *pRSSIdBm)
   @brief  Read the packet that was received by the radio.
   @param  BufferLen :{1-240} Size of passed in buffer
   @param  pPktLen :{1-240}   Storage for size of actual received packet
   @param  pData :{}     Received Packet will be stored here.
   @param  pRSSIdBm :{}  RSSI of received packet in dBm.
   @pre    RadioInit() must be called before this function is called.
   @pre    RadioRxPacketFixedLen() or equivalent should be called first.
   @code    
      if (RIE_Response == RIE_Success)
         RIE_Response = RadioRxPacketFixedLen(12);
      if (RIE_Response == RIE_Success)
         {
         while (!RadioRxPacketAvailable());
         }
      if (RIE_Response == RIE_Success)
         {
         unsigned char  Buffer[0x20];
         RIE_U8         PktLen;
         RIE_S8         RSSI;
         RIE_Response = RadioRxPacketRead(sizeof(Buffer),&PktLen,Buffer,&RSSI);
         }
   @endcode
   @note   Check for the presence of a packet by calling RadioRxPacketAvailable();
   @return  RIE_Responses  Error code
**/
RIE_Responses RadioRxPacketRead(RIE_U8 BufferLen,RIE_U8 *pPktLen,RIE_U8 *pData,RIE_S8 *pRSSIdBm)
{
   RIE_Responses  Response     = RIE_Success;

   if (RadioRxPacketAvailable())
      {
      RIE_U8 RdLen;
      if(RadioConfiguration.packet_length_control_r & packet_length_control_packet_len_fixed)
         {
         if (pPktLen)
            *pPktLen = RadioConfiguration.packet_length_max_r;
         RdLen = RadioConfiguration.packet_length_max_r;
         if (RdLen > BufferLen)
            RdLen = BufferLen;
         if (Response == RIE_Success)
            Response = RadioMMapRead(PACKETRAM_START,RdLen, pData);
         }
      else
         {
         if (Response == RIE_Success)
            Response = RadioMMapRead(PACKETRAM_START,0x1, &RdLen);
         RdLen -= 0x1;
         if (pPktLen)
            *pPktLen = RdLen;
         if (RdLen > BufferLen)
            RdLen = BufferLen;
         if (Response == RIE_Success)
            Response = RadioMMapRead(PACKETRAM_START+0x1,RdLen, pData);
         }

      if (pRSSIdBm)
         {
         if (Response == RIE_Success)
            Response = RadioMMapRead(MCR_rssi_readback_Adr,0x1, (RIE_U8 *)pRSSIdBm);

         *pRSSIdBm -= 107; // Convert to dBm
         }

      }
   else
      {
      if (pPktLen)
         *pPktLen = 0x0;
      }

   return Response;
}

/** 
   @fn      RIE_Responses RadioRxBERTestMode(void)
   @brief   Enter receiver Bit Error Rate (BER) test mode where the
             clock and data appear on GPIO pins.
             Clock on P0.6 and Data on P2.6
   @pre     RadioInit() must be called before this function is called.
   @code    
      Response = RadioRxBERTestMode();
   @endcode
   @note   Terminate this mode by calling RadioTerminateRadioOp();
   @return  RIE_Responses  Error code
**/
RIE_Responses RadioRxBERTestMode(void)
{
   RIE_Responses Response = RIE_Success;
   RIE_U8        Data;
   // Enables internal radio signals on external pins
   // but overrides some of the standard GPIO muxed 
   // functionality (UART?)
   pADI_MISC->RFTST = 0x7E1;

   if(Response == RIE_Success)
      Response = RadioCommitRadioConfig();

   bTestModeEnabled = RIE_TRUE;
   // Enable the RX signals on GPIO pins
   Data = gpio_configure_sport_mode_0;
   if (Response == RIE_Success)
      Response = RadioMMapWrite(MCR_gpio_configure_Adr, 0x1, (RIE_U8 *)&Data);

   // disable ext_uc_clk on GP5
   Data = 0;
   if (Response == RIE_Success)
      Response = RadioMMapWrite(MCR_ext_uc_clk_divide_Adr,
                                0x1,
                                (RIE_U8 *)&Data);
   if (Response == RIE_Success)
      Response = RadioSendCommandWait(CMD_PHY_RX);
   return Response;
}

/** 
    @internal Hide from Doxegen
    @fn       RIE_Responses RadioCommitRadioConfig(void)
    @brief    Configures the radio if any changes were made
              since the last time.
    @return  RIE_Responses  Error code
**/
static RIE_Responses RadioCommitRadioConfig(void)
{
   RIE_Responses Response = RIE_Success;

   if(bTestModeEnabled)
      {
      RIE_U8        Data;
      Data = gpio_configure_default;
      if (Response == RIE_Success)
         Response = RadioMMapWrite(MCR_gpio_configure_Adr, 0x1, (RIE_U8 *)&Data);
      Data = 4;
      if (Response == RIE_Success)
         Response = RadioMMapWrite(MCR_ext_uc_clk_divide_Adr,
                                   0x1,
                                   (RIE_U8 *)&Data);

