contiki-os/contiki/cpu/arm/aducrf101/Common/radioeng.c
      Data = PARAM_TX_NORMAL_PACKET;
      if (Response == RIE_Success)
         Response = RadioMMapWrite(PR_var_tx_mode_ADR,sizeof(Data),&Data);
      bTestModeEnabled = RIE_FALSE;
      }
   if (bRadioConfigurationChanged)
      {
      Response = RadioConfigure();
      if(Response == RIE_Success)
         bRadioConfigurationChanged = RIE_FALSE;
      }
   return Response;
}
/** 
    @fn      RIE_Responses RadioReadState(RadioState *pState)
    @brief   Read the current state
    @param   pState      Pointer to return storage of state
    @return  RIE_Responses  Error code
**/
static RIE_Responses RadioReadState(RadioState *pState)
{
   RIE_Responses  Response    = RIE_Success;
   RIE_U8         StatusByte;

   NVIC_DisableIRQ(UHFTRX_IRQn);
   RADIO_CSN_ASSERT;
   if (Response == RIE_Success)
      Response = RadioSPIXferByte(SPI_NOP,NULL);
   if (Response == RIE_Success)
      Response = RadioSPIXferByte(SPI_NOP,&StatusByte);
   RADIO_CSN_DEASSERT;
   NVIC_EnableIRQ      (UHFTRX_IRQn);
   if ((Response == RIE_Success) && pState)
      *pState = (RadioState)(StatusByte & STATUS_BYTE_FW_STATE);
   return Response;
}

/** 
    @fn      RIE_Responses RadioWaitOnState(RadioState FinalState)
    @brief   Wait for Final State to be reached
    @param   FinalState    State to wait on
    @return  RIE_Responses  Error code
**/
static RIE_Responses  RadioWaitOnState(RadioState FinalState)
{
   RIE_Responses  Response = RIE_Success;
   RadioState     CurrState;
   do
      {
      Response   = RadioReadState(&CurrState);
      }
   while((Response == RIE_Success) && (CurrState != FinalState));
   return Response;
}

/** 
    @fn      RIE_Responses  RadioWaitOnCmdLdr(void)
    @brief   Wait for Final State to be reached
    @param   FinalState    State to wait on
    @return  RIE_Responses  Error code
**/
static RIE_Responses  RadioWaitOnCmdLdr(void)
{
   RIE_Responses  Response = RIE_Success;
   do
      {
      RIE_U8         StatusByte;
      NVIC_DisableIRQ(UHFTRX_IRQn);
      RADIO_CSN_ASSERT;
      if (Response == RIE_Success)
         Response = RadioSPIXferByte(SPI_NOP,NULL);
      if (Response == RIE_Success)
         Response = RadioSPIXferByte(SPI_NOP,&StatusByte);
      RADIO_CSN_DEASSERT; 
      NVIC_EnableIRQ      (UHFTRX_IRQn);
      if ((Response == RIE_Success))
         if(StatusByte & STATUS_BYTE_CMD_READY)
            break;
      }
   while((Response == RIE_Success));
   return Response;
}

/** 
    @internal Hide from Doxegen
    @fn      RIE_Responses RadioToOnMode(void)
    @brief   Transition to On Mode

             Handle all possible states that the radio could be in  
             and brings it back to PHY_ON state                     
    @param   None
    @return  RIE_Responses  Error code
**/
static RIE_Responses RadioToOnMode(void)
{
   RIE_Responses  Response = RIE_Success;
   RadioState     FwState;

   if (Response == RIE_Success)
      Response = RadioReadState(&FwState);

   while ((FwState != FW_ON) && (Response == RIE_Success))
       {
       switch (FwState)
           {
           case FW_BUSY:
               break;
           case FW_TX:
              if(Response == RIE_Success)
                 Response = RadioSendCommandNoWait(CMD_PHY_ON);
               if (Response == RIE_Success)
                  Response = RadioWaitOnState   (FW_ON);
               break;
           case FW_RX:
              if(Response == RIE_Success)
                 Response = RadioSendCommandNoWait(CMD_PHY_ON);
               if (Response == RIE_Success)
                  Response = RadioWaitOnState   (FW_ON);
               break;
           default:
              if(Response == RIE_Success)
                 Response = RadioSendCommandNoWait(CMD_PHY_ON);
               if (Response == RIE_Success)
                  Response = RadioWaitOnState   (FW_ON);
               break;
           }
       if (Response == RIE_Success)
          Response = RadioReadState(&FwState);
       }
   return Response;
}
/** 
    @internal Hide from Doxegen
    @fn      RIE_Responses RadioToOffMode(void)
    @brief   Transition to Off Mode

             Handle all possible states that the radio could be in 
             and bring it back to PHY_OFF state.

    @param   None
    @return  RIE_Responses  Error code
**/
static RIE_Responses RadioToOffMode(void)
{
   RIE_Responses  Response = RIE_Success;
   RadioState     FwState;

   if (Response == RIE_Success)
      Response = RadioReadState(&FwState);

   while ((FwState != FW_OFF) && (Response == RIE_Success))
       {
       switch (FwState)
           {
           case FW_BUSY:
               break;
           case FW_TX:
              if(Response == RIE_Success)
                 Response = RadioSendCommandNoWait(CMD_PHY_ON);
               if (Response == RIE_Success)
                  Response = RadioWaitOnState   (FW_ON);
               break;
           case FW_RX:
              if(Response == RIE_Success)
                 Response = RadioSendCommandNoWait(CMD_PHY_ON);
               if (Response == RIE_Success)
                  Response = RadioWaitOnState   (FW_ON);
               break;
           default:
              if(Response == RIE_Success)
                 Response = RadioSendCommandNoWait(CMD_PHY_OFF);
               if (Response == RIE_Success)
                  Response = RadioWaitOnState   (FW_OFF);
               break;
           }
       if (Response == RIE_Success)
          Response = RadioReadState(&FwState);
       }
   return Response;
}
/** 
    @internal Hide from Doxegen
    @fn      RIE_Responses  RadioSyncComms       (void)
    @brief   Sync comms with the radio
    @param   None
    @return  RIE_Responses  Error code
**/
static RIE_Responses  RadioSyncComms       (void)
{
   RIE_Responses  Response = RIE_Success;
   if (Response == RIE_Success)
      Response = RadioSendCommandWait(CMD_SYNC);
   if (Response == RIE_Success)
      Response = RadioWaitOnCmdLdr();
   return Response;
}
/** 
    @fn      RIE_Responses  RadioWaitForPowerUp(void)
    @brief   Wake Up the Part

             Assert SPI chip select which will wake up the radio if asleep
             Wait for MISO line to go high indicating SPI comms now possible

    @return  RIE_Responses  Error code
**/
static RIE_Responses  RadioWaitForPowerUp(void)
{
   RIE_Responses  Response = RIE_Success;
   int            i        = 0x0;
   RADIO_CSN_ASSERT;
   while (!RADIO_MISO_IN && (i < 1000)) 
      i++;
   if (1000 == i)// Timed out waiting for MISO high?
      Response = RIE_RadioSPICommsFail;
   RADIO_CSN_DEASSERT;
   return Response;
}

/** 
    \internal Hide from Doxegen
    \fn      void Ext_Int8_Handler(void)
    \brief   Radio Interrupt Handler
**/
void Ext_Int8_Handler (void)
{
   RIE_Responses  Response = RIE_Success;
   RIE_U8         ucInt0;
   RIE_U8         ucInt1;

   if (Response == RIE_Success)
      Response = RadioMMapRead(MCR_interrupt_source_0_Adr,0x1, &ucInt0);
   if (Response == RIE_Success)
      Response = RadioMMapRead(MCR_interrupt_source_1_Adr,0x1,&ucInt1);
   if (ucInt0 & interrupt_mask_0_interrupt_tx_eof)
      bPacketTx = RIE_TRUE;
   if (ucInt0 & interrupt_mask_0_interrupt_crc_correct)
      bPacketRx = RIE_TRUE;
   // Clear all the interrupts that we have just handleed
   if (Response == RIE_Success)
      Response = RadioMMapWrite(MCR_interrupt_source_0_Adr,0x1, &ucInt0);
   if (Response == RIE_Success)
      Response = RadioMMapWrite(MCR_interrupt_source_1_Adr,0x1,&ucInt1);
    // Clear the interrupt
    pADI_INTERRUPT->EICLR = EICLR_IRQ8;
}
/** 
    \internal Hide from Doxegen
    \fn      void RadioSPIXferByte(RIE_U8 ucByte,RIE_U8 *pData)
    \brief   Transfer a byte via SPI to the radio and optionally return
             received byte.
             Chip Select is manually controlled elsewhere.
    \param   ucByte  Command or data byte to be transferred.
    \param   pData   NULL, or storage for response
    \return  RIE_Responses  Error code
**/
static RIE_Responses RadioSPIXferByte(RIE_U8 ucByte,RIE_U8 *pData)
{
   RIE_Responses  Response = RIE_Success;

   SEND_SPI(ucByte);  // Send byte
   WAIT_SPI_RX;       // wait for data received status bit
   if(pData)
      *pData = READ_SPI;
   else
      (void)READ_SPI;
   return Response;
}
/** 
    \internal Hide from Doxegen
    \fn      RIE_Responses RadioSendCommandBytes(RIE_U8 *pCmdBytes,RIE_U8 NumBytes)
    \brief   Send a complete command to the radio.

             It is neccessary to disable the radio interrupt when doing this
             as a command in progress must finish before a radio interrupt 
             can be handled.

    \param   pCmdBytes Pointer to a number of bytes to be transferred.
    \param   NumBytes  Number of bytes to transfer

