contiki-os/contiki/cpu/arm/aducrf101/Common/radioeng.c
    \return  RIE_Responses  Error code
**/
static RIE_Responses RadioSendCommandBytes(RIE_U8 *pCmdBytes,RIE_U8 NumBytes)
{
   RIE_Responses  Response = RIE_Success;

   NVIC_DisableIRQ(UHFTRX_IRQn);
   RADIO_CSN_ASSERT;
   while ((NumBytes--) && (Response == RIE_Success))
      Response = RadioSPIXferByte(*(pCmdBytes++),NULL); // Send Command
   RADIO_CSN_DEASSERT;   // De-assert SPI chip select
   NVIC_EnableIRQ      (UHFTRX_IRQn);

   return Response;
}
/** 
    \internal Hide from Doxegen
    \fn      RIE_Responses RadioSendCommandNoWait        (Radio_CmdCodes CmdCode )
    \brief   Send a single byte command to the radio.
    \param   CmdCode Command code to be sent
    \return  RIE_Responses  Error code
**/
static RIE_Responses RadioSendCommandNoWait (Radio_CmdCodes CmdCode )
{
   RIE_U8 Command = (RIE_U8)CmdCode;
   return RadioSendCommandBytes(&Command,0x1);
}
/** 
    \internal Hide from Doxegen
    \fn      RIE_Responses RadioSendCommandWait        (Radio_CmdCodes CmdCode )
    \brief   Send a single byte command to the radio.
    \param   CmdCode Command code to be sent
    \return  RIE_Responses  Error code
**/
static RIE_Responses RadioSendCommandWait (Radio_CmdCodes CmdCode )
{
   RIE_Responses  Response = RIE_Success;
   RIE_U8         Command  = (RIE_U8)CmdCode;

   if (Response == RIE_Success)
      Response = RadioWaitOnCmdLdr();
   if (Response == RIE_Success)
      Response = RadioSendCommandBytes(&Command,0x1);
   return Response;
}
/** 
    \fn      RIE_Responses RadioMMapRead(RIE_U32 ulAdr, RIE_U32 ulLen, RIE_U8 *pData)
    \brief   Read bytes from specified memory map address
    \param   ulAdr  Address to read at.
    \param   ulLen  Length of data to read.
    \param   pData  Pointer to location to stored read data.
    \return  RIE_Responses  Error code
**/
static RIE_Responses RadioMMapRead(RIE_U32 ulAdr, RIE_U32 ulLen, RIE_U8 *pData)
{
   RIE_Responses  Response = RIE_Success;

   NVIC_DisableIRQ(UHFTRX_IRQn);
   RADIO_CSN_ASSERT;
   
   if(Response == RIE_Success) // Send first byte (SPI_MEMR_RD + Bytes)
      Response = RadioSPIXferByte(SPI_MEM_RD | ((ulAdr & 0x700) >> 8),NULL);
   if(Response == RIE_Success)// Send Second byte remainder of address
      Response = RadioSPIXferByte((RIE_U8)(ulAdr & 0xFF),NULL);
   if(Response == RIE_Success)
      Response = RadioSPIXferByte((RIE_U8)SPI_NOP,NULL);
   while(ulLen-- && (Response == RIE_Success))
      Response = RadioSPIXferByte(SPI_NOP,pData++);
   RADIO_CSN_DEASSERT;
   NVIC_EnableIRQ      (UHFTRX_IRQn);

   return Response;
}
/** 
    \fn      RIE_Responses RadioMMapWrite(RIE_U32 ulAdr, RIE_U32 ulLen, RIE_U8 *pData)
    \brief   Read bytes from specified memory map address
    \param   ulAdr  Address to read at.
    \param   ulLen  Length of data to read.
    \param   pData  Pointer to location of data to write.
    \return  RIE_Responses  Error code
**/
static RIE_Responses RadioMMapWrite(RIE_U32 ulAdr,RIE_U32   ulLen,RIE_U8 *  pData)
{
   RIE_Responses  Response = RIE_Success;

   NVIC_DisableIRQ(UHFTRX_IRQn);
   RADIO_CSN_ASSERT;
   if(Response == RIE_Success) // Send first byte (SPI_MEMR_WR + Bytes)
      Response = RadioSPIXferByte(SPI_MEM_WR | ((ulAdr & 0x700) >> 8),NULL);
   if(Response == RIE_Success) // Send Second byte remainder of addrress
      Response = RadioSPIXferByte((RIE_U8)(ulAdr & 0xFF),NULL);
   while(ulLen-- && (Response == RIE_Success))
      Response = RadioSPIXferByte(*(pData++),NULL);
   RADIO_CSN_DEASSERT;
   NVIC_EnableIRQ      (UHFTRX_IRQn);

   return Response;
}

/** 
    \internal Hide from Doxegen
    \fn      void SetRadioConfiguration(void)
    \brief   Create a default radio configuration that all base configurations
             are derived from.

    \return  RIE_Responses  Error code
**/
static RIE_Responses SetRadioConfiguration(RIE_BaseConfigs BaseConfig)
{
   RIE_Responses  Response = RIE_Success;

   bRadioConfigurationChanged = RIE_TRUE;
   switch (BaseConfig)
      {
      case DR_1_0kbps_Dev10_0kHz:
         memcpy((void *)&RadioConfiguration,
                (void *)DR_1_0kbps_Dev10_0kHz_Configuration,
                sizeof(TyRadioConfiguration));
         DataRate = 1000;
         break;
      case DR_38_4kbps_Dev20kHz:
         memcpy((void *)&RadioConfiguration,
                (void *)DR_38_4kbps_Dev20kHz_Configuration,
                sizeof(TyRadioConfiguration));
         DataRate = 38400;
         break;
      case DR_300_0kbps_Dev75_0kHz:
         memcpy((void *)&RadioConfiguration,
                (void *)DR_300_0kbps_Dev75_0kHz_Configuration,
                sizeof(TyRadioConfiguration));
         DataRate = 300000;
         break;
      default:
         Response = RIE_UnsupportedRadioConfig;
         break;
      }
   return Response;
}
/** 
    @internal Hide from Doxegen
    @fn      RIE_Responses RadioConfigure       (void)
    @brief   Configure the Radio as per the current configuration
    @return  RIE_Responses  Error code
**/
RIE_Responses RadioConfigure (void)
{
   RIE_Responses  Response = RIE_Success;
   if(Response == RIE_Success)
      Response = RadioToOffMode();
   if(Response == RIE_Success) // Write the configuration to the radio memory
      Response = RadioMMapWrite(BBRAM_START, 
                                sizeof(TyRadioConfiguration), 
                                (RIE_U8 *)&RadioConfiguration);
   if(Response == RIE_Success) // Apply that configuration to the radio
      Response = RadioSendCommandWait(CMD_CONFIG_DEV);
   if(Response == RIE_Success)
      Response = RadioToOnMode();
   return Response;
}


/** 
   @fn     RIE_Responses RadioRadioGetRSSI (RIE_S8 *pRSSIdBm)
   @brief  Return a Received Signal Strength Indicator value
   @param  pRSSIdBm :{}  detected RSSI in dBm.
   @pre     RadioInit() must be called before this function is called.
   @code    
      RIE_S8 RSSIdBm;
      if (RIE_Response == RIE_Success)
         RIE_Response = RadioRadioGetRSSI(&RSSIdBm);
   @endcode
   @return  RIE_Responses  Error code
**/
RIE_Responses RadioRadioGetRSSI (RIE_S8 *pRSSIdBm)
{
   RIE_Responses  Response     = RIE_Success;

