contiki-os/contiki/cpu/arm/aducrf101/Common/radioeng.c
   if(Response == RIE_Success)
      Response = RadioCommitRadioConfig();
   if (Response == RIE_Success)
      Response = RadioToOnMode();
   if (Response == RIE_Success)
      Response = RadioSendCommandWait(CMD_GET_RSSI);
   if (Response == RIE_Success)
      Response = RadioSyncComms(); // 
   if (pRSSIdBm)
      {
      if (Response == RIE_Success)
         Response = RadioMMapRead(MCR_rssi_readback_Adr,0x1, (RIE_U8 *)pRSSIdBm);
      *pRSSIdBm -= 107; // Convert to dBm
      }
   return Response;
}

/** 
   @fn     RIE_Responses RadioTxSetPower(RIE_PAPowerLevel Power)    
   @brief  Set the Transmit Power Level for Radio Transmission. 
   @param  Power :{PowerLevel0 ,PowerLevel1 ,PowerLevel2 ,PowerLevel3,
           PowerLevel4 ,PowerLevel5 ,PowerLevel6 ,PowerLevel7,
           PowerLevel8 ,PowerLevel9 ,PowerLevel10,PowerLevel11,
           PowerLevel12,PowerLevel13,PowerLevel14,PowerLevel15} 
   @pre    RadioInit() must be called before this function is called.
   @code    
      Response = RadioTxSetPower(PowerLevel8);
   @endcode
   @note   Max TX Power is used by default.
   @return  RIE_Responses  Error code
*/
RIE_Responses RadioTxSetPower (RIE_PAPowerLevel Power)
{
   RIE_Responses  Response     = RIE_Success;
   RIE_U8         ucNewRegVal  = RadioConfiguration.radio_cfg_8_r;
   unsigned long  pa_level_mcr,pa_ramp, codes_per_bit,min_codes_per_bit;

   if (RadioConfiguration.radio_cfg_8_r & radio_cfg_8_pa_single_diff_sel_differential)
      ucNewRegVal  = radio_cfg_8_pa_single_diff_sel_differential;
   else
      ucNewRegVal  = radio_cfg_8_pa_single_diff_sel_single_ended;

   if(Response == RIE_Success)
      {
      switch (Power)
         {
         case PowerLevel0 :
         case PowerLevel1 :
         case PowerLevel2 :
         case PowerLevel3 :
         case PowerLevel4 :
         case PowerLevel5 :
         case PowerLevel6 :
         case PowerLevel7 :
         case PowerLevel8 :
         case PowerLevel9 :
         case PowerLevel10:
         case PowerLevel11:
         case PowerLevel12:
         case PowerLevel13:
         case PowerLevel14:
         case PowerLevel15:
            ucNewRegVal |= ((RIE_U8)Power << radio_cfg_8_pa_power_offset);
            // Calculate the minimum allowable codes per bit
            pa_level_mcr =  (((RIE_U8)Power)* 4) + 0x3;
            min_codes_per_bit = (pa_level_mcr * 2500)/(DataRate/100);
            pa_ramp        = 0x1;
            codes_per_bit  = 256;
            while (codes_per_bit > min_codes_per_bit)
               {
               pa_ramp++;
               codes_per_bit = 512 >> pa_ramp;
               if (pa_ramp >= 7)
                  break; // This is the maximum
               }
            ucNewRegVal |= ((RIE_U8)pa_ramp << radio_cfg_8_pa_ramp_offset);
            break;
         default:
            Response   = RIE_UnsupportedRadioConfig;
            break;
         }
      }

   if(Response == RIE_Success)
      {
      if (ucNewRegVal != RadioConfiguration.radio_cfg_8_r )
         {
         // Write directly to the MCR in this case and avoid a reconfigure
         if (Response == RIE_Success)
            Response = RadioMMapWrite(MCR_pa_level_mcr_Adr, 0x1, (RIE_U8 *)&ucNewRegVal);
         RadioConfiguration.radio_cfg_8_r  = ucNewRegVal; 
         }
      }
   return Response;
}

